ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/HSM/f29h85x_hsm_dthe_regs.xml
<module id="HSM_DTHE" HW_revision="" description="HSM DTHE Registers">
	<register id="REVISION" width="32" page="0" offset="0" internal="0" description="">
		<bitfield id="REVMIN" description="" begin="5" end="0" width="6" rwaccess="R"/>
		<bitfield id="CUSTOM" description="" begin="7" end="6" width="2" rwaccess="R"/>
		<bitfield id="REVMAJ" description="" begin="10" end="8" width="3" rwaccess="R"/>
		<bitfield id="REVRTL" description="" begin="15" end="11" width="5" rwaccess="R"/>
		<bitfield id="MODID" description="" begin="27" end="16" width="12" rwaccess="R"/>
		<bitfield id="BU" description="" begin="29" end="28" width="2" rwaccess="R"/>
		<bitfield id="SCHEME" description="" begin="31" end="30" width="2" rwaccess="R"/>
	</register>
	<register id="CAPABILITY" width="32" page="0" offset="4" internal="0" description="">
		<bitfield id="AES_COUNTERMEASURE" description="" begin="31" end="31" width="1" rwaccess="R"/>
		<bitfield id="AES_ENABLED" description="" begin="24" end="24" width="1" rwaccess="R"/>
		<bitfield id="SM4_ENABLED" description="" begin="17" end="17" width="1" rwaccess="R"/>
		<bitfield id="SM3_ENABLED" description="" begin="16" end="16" width="1" rwaccess="R"/>
		<bitfield id="SHA_ENABLED" description="" begin="8" end="8" width="1" rwaccess="R"/>
		<bitfield id="TRNG_ENABLED" description="" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="PKA_ENABLED" description="" begin="0" end="0" width="1" rwaccess="R"/>
	</register>
	<register id="CLK_GATE_CFG" width="32" page="0" offset="512" internal="0" description="">
		<bitfield id="SHA_CG_CFG" description="" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="AES_CG_CFG" description="" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="TRNG_CG_CFG" description="" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="PKA_CG_CFG" description="" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="SM3_CG_CFG" description="" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="SM4_CG_CFG" description="" begin="7" end="7" width="1" rwaccess="RW"/>
	</register>
</module>
